GD32-MCU-IOT/gd32_rt-thread/bsp/gd32/arm/libraries/gd32_drivers/drv_gpio.c
    value = gpio_input_bit_get(index->gpio_periph, index->pin);
    return value;
}

/**
  * @brief  bit2bitno
  * @param  bit
  * @retval None
  */
rt_inline rt_int32_t bit2bitno(rt_uint32_t bit)
{
    rt_uint8_t i;
    for (i = 0; i < 32; i++)
    {
        if ((0x01 << i) == bit)
        {
            return i;
        }
    }
    return -1;
}

/**
  * @brief  pin write
  * @param  pinbit
  * @retval None
  */
rt_inline const struct pin_irq_map *get_pin_irq_map(rt_uint32_t pinbit)
{
    rt_int32_t map_index = bit2bitno(pinbit);
    if (map_index < 0 || map_index >= ITEM_NUM(pin_irq_map))
    {
        return RT_NULL;
    }
    return &pin_irq_map[map_index];
}

#if defined SOC_SERIES_GD32M53x
/* Get EXTI mapping entry for M53x specific pin */
static const struct gd32m53x_exti_map* gd32m53x_get_exti_map(const struct pin_index *index)
{
    for (int i = 0; i < ITEM_NUM(gd32m53x_exti_map); i++) {
        if (gd32m53x_exti_map[i].port == index->gpio_periph && 
            gd32m53x_exti_map[i].pin == index->pin) {
            return &gd32m53x_exti_map[i];
        }
    }
    return RT_NULL;
}
#endif

/**
  * @brief  pin irq attach
  * @param  device, pin, mode
  * @retval None
  */
static rt_err_t gd32_pin_attach_irq(struct rt_device *device, rt_base_t pin,
                              rt_uint8_t mode, void (*hdr)(void *args), void *args)
{
    const struct pin_index *index = RT_NULL;
    rt_base_t level;
    rt_int32_t hdr_index = -1;

    index = get_pin(pin);
    if (index == RT_NULL)
    {
        return -RT_EINVAL;
    }

#if defined SOC_SERIES_GD32M53x
    /* For M53x, use EXTI line number as index */
    const struct gd32m53x_exti_map* exti_map = gd32m53x_get_exti_map(index);
    if (exti_map == RT_NULL)
    {
        return -RT_EINVAL;
    }
    hdr_index = bit2bitno(exti_map->exti_line);
#else
    hdr_index = bit2bitno(index->pin);
#endif
    if (hdr_index < 0 || hdr_index >= ITEM_NUM(pin_irq_map))
    {
        return -RT_EINVAL;
    }

    level = rt_hw_interrupt_disable();
    if (pin_irq_hdr_tab[hdr_index].pin == pin &&
        pin_irq_hdr_tab[hdr_index].hdr == hdr &&
        pin_irq_hdr_tab[hdr_index].mode == mode &&
        pin_irq_hdr_tab[hdr_index].args == args)
    {
        rt_hw_interrupt_enable(level);
        return RT_EOK;
    }

    if (pin_irq_hdr_tab[hdr_index].pin != -1)
    {
        rt_hw_interrupt_enable(level);
        return -RT_EFULL;
    }
    pin_irq_hdr_tab[hdr_index].pin = pin;
    pin_irq_hdr_tab[hdr_index].hdr = hdr;
    pin_irq_hdr_tab[hdr_index].mode = mode;
    pin_irq_hdr_tab[hdr_index].args = args;
    rt_hw_interrupt_enable(level);

    return RT_EOK;
}

/**
  * @brief  pin irq detach
  * @param  device, pin
  * @retval None
  */
static rt_err_t gd32_pin_detach_irq(struct rt_device *device, rt_base_t pin)
{
    const struct pin_index *index = RT_NULL;
    rt_base_t level;
    rt_int32_t hdr_index = -1;

    index = get_pin(pin);
    if (index == RT_NULL)
    {
        return -RT_EINVAL;
    }

#if defined SOC_SERIES_GD32M53x
    /* For M53x, use EXTI line number as index */
    const struct gd32m53x_exti_map* exti_map = gd32m53x_get_exti_map(index);
    if (exti_map == RT_NULL)
    {
        return -RT_EINVAL;
    }
    hdr_index = bit2bitno(exti_map->exti_line);
#else
    hdr_index = bit2bitno(index->pin);
#endif
    if (hdr_index < 0 || hdr_index >= ITEM_NUM(pin_irq_map))
    {
        return -RT_EINVAL;
    }

    level = rt_hw_interrupt_disable();
    if (pin_irq_hdr_tab[hdr_index].pin == -1)
    {
        rt_hw_interrupt_enable(level);
        return RT_EOK;
    }
    pin_irq_hdr_tab[hdr_index].pin = -1;
    pin_irq_hdr_tab[hdr_index].hdr = RT_NULL;
    pin_irq_hdr_tab[hdr_index].mode = 0;
    pin_irq_hdr_tab[hdr_index].args = RT_NULL;
    rt_hw_interrupt_enable(level);

    return RT_EOK;
}

/**
  * @brief  pin irq enable
  * @param  device, pin, enabled
  * @retval None
  */
static rt_err_t gd32_pin_irq_enable(struct rt_device *device, rt_base_t pin, rt_uint8_t enabled)
{
    const struct pin_index *index;
    const struct pin_irq_map *irqmap;
    rt_base_t level;
    rt_int32_t hdr_index = -1;
    exti_trig_type_enum trigger_mode;
#if defined SOC_SERIES_GD32M53x
    uint32_t m53x_exti_line = 0;
#endif

    index = get_pin(pin);
    if (index == RT_NULL)
    {
        return -RT_EINVAL;
    }

    if (enabled == PIN_IRQ_ENABLE)
    {
#if defined SOC_SERIES_GD32M53x
        /* For M53x, get EXTI mapping and use EXTI line number as index */
        const struct gd32m53x_exti_map* exti_map = gd32m53x_get_exti_map(index);
        if (exti_map == RT_NULL)
        {
            return -RT_EINVAL;
        }
        hdr_index = bit2bitno(exti_map->exti_line);
#else
        hdr_index = bit2bitno(index->pin);
#endif
        if (hdr_index < 0 || hdr_index >= ITEM_NUM(pin_irq_map))
        {
            return -RT_EINVAL;
        }

        level = rt_hw_interrupt_disable();
        if (pin_irq_hdr_tab[hdr_index].pin == -1)
        {
            rt_hw_interrupt_enable(level);
            return -RT_EINVAL;
        }

        irqmap = &pin_irq_map[hdr_index];

        switch (pin_irq_hdr_tab[hdr_index].mode)
        {
            case PIN_IRQ_MODE_RISING:
                trigger_mode = EXTI_TRIG_RISING;
                break;
            case PIN_IRQ_MODE_FALLING:
                trigger_mode = EXTI_TRIG_FALLING;
                break;
            case PIN_IRQ_MODE_RISING_FALLING:
                trigger_mode = EXTI_TRIG_BOTH;
                break;
            default:
                rt_hw_interrupt_enable(level);
                return -RT_EINVAL;
        }

#if defined SOC_SERIES_GD32F4xx || defined SOC_SERIES_GD32H7xx || defined SOC_SERIES_GD32F5xx \
 || defined SOC_SERIES_GD32H75E || defined SOC_SERIES_GD32G5x3 || defined SOC_SERIES_GD32L23x \
 || defined SOC_SERIES_GD32H77x || defined SOC_SERIES_GD32M53x
        rcu_periph_clock_enable(RCU_SYSCFG);
#elif defined SOC_SERIES_GD32E23x || defined SOC_SERIES_GD32F3x0
        rcu_periph_clock_enable(RCU_CFGCMP);
#else
        rcu_periph_clock_enable(RCU_AF);
#endif

        /* enable and set interrupt priority */
#if defined SOC_SERIES_GD32E23x || defined SOC_SERIES_GD32L23x
        nvic_irq_enable(irqmap->irqno, 5U);
#else
        nvic_irq_enable(irqmap->irqno, 5U, 0U);
#endif
        /* connect EXTI line to  GPIO pin */
#if defined SOC_SERIES_GD32F4xx || defined SOC_SERIES_GD32H7xx || defined SOC_SERIES_GD32F5xx || defined SOC_SERIES_GD32E23x \
 || defined SOC_SERIES_GD32L23x || defined SOC_SERIES_GD32H75E || defined SOC_SERIES_GD32F3x0 || defined SOC_SERIES_GD32G5x3
        syscfg_exti_line_config(index->port_src, index->pin_src);
#elif defined SOC_SERIES_GD32M53x
        /* GD32M53x: use pre-fetched EXTI mapping */
        syscfg_exti_line_config(exti_map->exti_gpio);
        m53x_exti_line = exti_map->exti_line;
#else
        gpio_exti_source_select(index->port_src, index->pin_src);
#endif

